# От конзолата се четат 5 реда:
# 1. Име на авиокомпанията - текст
# 2. Брой билети за възрастни – цяло число в диапазона [1…400]
# 3. Брой детски билети – цяло число в диапазона [25…120]
# 4. Нетна цена на билет за възрастен – реално число в диапазона [100.0…1600.0]
# 5. Цената на такса обслужване - реално число в диапазона [10.0…50.0]

# input
name = input()
adult_tickets = int(input())
children_ticket = int(input())
adult_price = float(input())
tax = float(input())

# logic
price_for_childer = adult_price - (adult_price * 0.7)
adult_price_with_tax = adult_price + tax
price_for_childer_tax = price_for_childer + tax
total = (adult_tickets * adult_price_with_tax) + (price_for_childer_tax * children_ticket)
profit = (total * 0.2)

print(F"The profit of your agency from {name} tickets is {profit:.2F} lv.")


# Напишете програма, която изчислява печалбата на агенция за продажба на самолетни билети. Агенцията
# продава самолетни билети на различни авиокомпании. Ще получите информация за броя продадени билети
# за възрастни и броя продадени детски билети. Нетната цена на билета за възрастен се определя от
# авиокомпанията, а детският билет е със 70% по-евтин. Агенцията добавя към нетната цена на всеки билет
# такса обслужване. Крайната печалба на Агенцията е 20% от общата цена на всички билети.