# От конзолата се четат 4 реда:
# 1. Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
# 2. Килограми на багажа – реално число в диапазона [1.0…32.0]
# 3. Дни до пътуването – цяло число в диапазона [1…6
# 4. Брой багажи – цяло число в диапазона [1…10

# input by user

price_fot_luggage = float(input())
luggage_weight =  float(input())
days_to_travel = int(input())
number = int(input())

# logic
luggage_to_10 = price_fot_luggage - (price_fot_luggage * 0.8)
luggage_to_10_20 = price_fot_luggage / 2





# Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
#  до 10кг – 20% от цената на багаж над 20кг
#  между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
#  над 20кг – таксата се чете от конзолата
# В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
#  повече от 30 дни - цената на багажа се оскъпява с 10%
#  между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
#  по-малко от 7 дни - цената на багажа се оскъпява с 40%
# Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.
#



